FIOLOG/nvme0n1_220605_155114_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=37573: Sun Jun  5 15:51:24 2022
  read: IOPS=40.5k, BW=158MiB/s (166MB/s)(1581MiB/10001msec)
    slat (nsec): min=1903, max=63975, avg=3474.36, stdev=2738.97
    clat (usec): min=1337, max=4259, avg=1577.28, stdev=33.76
     lat (usec): min=1340, max=4271, avg=1580.82, stdev=33.75
    clat percentiles (usec):
     |  1.00th=[ 1532],  5.00th=[ 1549], 10.00th=[ 1565], 20.00th=[ 1565],
     | 30.00th=[ 1582], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1598], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1696], 99.95th=[ 1778],
     | 99.99th=[ 3851]
   bw (  KiB/s): min=160832, max=162480, per=25.01%, avg=161917.47, stdev=404.65, samples=19
   iops        : min=40208, max=40620, avg=40479.37, stdev=101.16, samples=19
  lat (msec)   : 2=99.97%, 4=0.02%, 10=0.01%
  cpu          : usr=9.00%, sys=17.07%, ctx=178228, majf=0, minf=73
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=404650,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=37574: Sun Jun  5 15:51:24 2022
  read: IOPS=40.5k, BW=158MiB/s (166MB/s)(1581MiB/10002msec)
    slat (nsec): min=1851, max=71357, avg=3490.79, stdev=2786.22
    clat (usec): min=1338, max=4317, avg=1577.25, stdev=35.67
     lat (usec): min=1341, max=4333, avg=1580.81, stdev=35.66
    clat percentiles (usec):
     |  1.00th=[ 1532],  5.00th=[ 1549], 10.00th=[ 1565], 20.00th=[ 1565],
     | 30.00th=[ 1582], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1598], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1696], 99.95th=[ 1778],
     | 99.99th=[ 3785]
   bw (  KiB/s): min=160544, max=162528, per=25.01%, avg=161919.58, stdev=458.27, samples=19
   iops        : min=40136, max=40632, avg=40480.00, stdev=114.53, samples=19
  lat (msec)   : 2=99.97%, 4=0.02%, 10=0.01%
  cpu          : usr=9.77%, sys=16.66%, ctx=189165, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=404672,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=37575: Sun Jun  5 15:51:24 2022
  read: IOPS=40.5k, BW=158MiB/s (166MB/s)(1581MiB/10002msec)
    slat (nsec): min=1894, max=86561, avg=3471.42, stdev=2771.35
    clat (usec): min=1275, max=4261, avg=1577.20, stdev=34.25
     lat (usec): min=1278, max=4278, avg=1580.74, stdev=34.23
    clat percentiles (usec):
     |  1.00th=[ 1532],  5.00th=[ 1549], 10.00th=[ 1565], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1598], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1696], 99.95th=[ 1827],
     | 99.99th=[ 3818]
   bw (  KiB/s): min=160536, max=162496, per=25.02%, avg=161933.47, stdev=432.65, samples=19
   iops        : min=40134, max=40624, avg=40483.37, stdev=108.16, samples=19
  lat (msec)   : 2=99.97%, 4=0.03%, 10=0.01%
  cpu          : usr=10.00%, sys=16.19%, ctx=180574, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=404691,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=37576: Sun Jun  5 15:51:24 2022
  read: IOPS=40.5k, BW=158MiB/s (166MB/s)(1581MiB/10002msec)
    slat (nsec): min=1864, max=72201, avg=3467.44, stdev=2758.79
    clat (usec): min=1262, max=4288, avg=1577.40, stdev=35.58
     lat (usec): min=1266, max=4299, avg=1580.94, stdev=35.57
    clat percentiles (usec):
     |  1.00th=[ 1532],  5.00th=[ 1549], 10.00th=[ 1565], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1598], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1696], 99.95th=[ 1876],
     | 99.99th=[ 3851]
   bw (  KiB/s): min=160800, max=162424, per=25.01%, avg=161906.53, stdev=393.04, samples=19
   iops        : min=40200, max=40606, avg=40476.63, stdev=98.26, samples=19
  lat (msec)   : 2=99.96%, 4=0.03%, 10=0.01%
  cpu          : usr=9.61%, sys=16.65%, ctx=181931, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=404639,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=632MiB/s (663MB/s), 158MiB/s-158MiB/s (166MB/s-166MB/s), io=6323MiB (6630MB), run=10001-10002msec

Disk stats (read/write):
  nvme0n1: ios=1601645/0, merge=0/0, ticks=2518266/0, in_queue=2518266, util=99.05%